rafaelwanner/ES_with_Drones/LAB3/STM32 FW Project/Official release - 170120/Src/main.c
const float rad_deg_conversion = 180/3.1415;

float getAltitude(float press, float temperature);
float getPitch(AxesRaw_TypeDef acc);
float getRoll(AxesRaw_TypeDef acc);
float getYaw(AxesRaw_TypeDef mag, float pitch, float roll);

/* USER CODE END 0 */

int main(void)
{

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_ADC1_Init();
	MX_TIM2_Init();
	MX_TIM4_Init();
	MX_TIM9_Init();
	MX_USART1_UART_Init();
	//MX_USB_DEVICE_Init();

	/* USER CODE BEGIN 2 */

	PRINTF("STEVAL-FCU001V1 FW rev.1.0 - Sep 2017\n\r\n\r");

	//  Initialize Onboard LED
	BSP_LED_Init(LED1);
	BSP_LED_Init(LED2);
	BSP_LED_Off(LED1);
	BSP_LED_Off(LED2);

	/* Configure and disable all the Chip Select pins for sensors on SPI*/
	Sensor_IO_SPI_CS_Init_All();

	/* Initialize and Enable the available sensors on SPI*/
	initializeAllSensors();
	enableAllSensors();

	/* Initialize General purpose TIM9 */
	/* Timer9 interrupt @ 800Hz */
	/* This timer generates an internal interrupt calling the function
	 * HAL_TIM_PeriodElapsedCallback
	 */
	HAL_TIM_Base_Start_IT(&htim9);

	/* BLE communication */
	PRINTF("LAB3 Init...\n\r\n\r");

	/* Read initial value of Pressure and Temperature for Altitude estimation */
	/* Read the Pressure level when arming (0m reference) for altitude calculation */
	BSP_PRESSURE_Get_Press(LPS22HB_P_0_handle, &press_zero_level);
	/* Read the Temperature when arming (0m reference) for altitude calculation */
	BSP_TEMPERATURE_Get_Temp(LPS22HB_T_0_handle, &temperature);

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{

		/* print the measured sensors at 1 Hz */
		/* sample rate is 800 Hz */

		/* INSERT YOUR CODE HERE!!!! LAB3 */
		//PRINTF("************************************\n\r\n\r");
		//PRINTF("ACC[x,y,z] %d mg %d mg %d mg \n\r", acc.AXIS_X,acc.AXIS_Y,acc.AXIS_Z);
		//PRINTF("GYR[x,y,z] %d mdps %d mdps %d mdps \n\r", gyro.AXIS_X,gyro.AXIS_Y,gyro.AXIS_Z);
		//PRINTF("MAG[x,y,z] %d mg %d mg %d mg \n\r", mag.AXIS_X,mag.AXIS_Y,mag.AXIS_Z);
		//PRINTF("Pre: %f hPa \n\r", press);
		//PRINTF("************************************\n\r\n\r");

		//Calculate altitude
		float alt = getAltitude(press, temperature);

		//Calculate pitch, roll and yaw
		float pitch = getPitch(acc);
		float roll = getRoll(acc);
		float yaw = getYaw(mag, pitch, roll);

		float pitch_deg = rad_deg_conversion * pitch;
		float roll_deg = rad_deg_conversion * roll;
		float yaw_deg = rad_deg_conversion * yaw;

		/*
		PRINTF("************************************\n\r\n\r");
		PRINTF("Pitch: %f deg, Roll: %f deg, Yaw: %f deg\n\r", pitch_deg, roll_deg, yaw_deg);
		PRINTF("Altitude: %f m\n\r", alt);
		PRINTF("************************************\n\r\n\r");
		*/

		if(pitch_deg > 60){
			BSP_LED_On(LED1);
		} else {
			BSP_LED_Off(LED1);
		}

		if(roll_deg > 60){
			BSP_LED_On(LED2);
		} else {
			BSP_LED_Off(LED2);
		}


		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */

		//This function provides accurate delay (in milliseconds)
		HAL_Delay(10);


	}
	/* USER CODE END 3 */

}

float getAltitude(float press, float temperature){
	float ratio = (press/press_zero_level);
	float power = 1/5.257;
	return ((pow(ratio, power) - 1) * (temperature + 273.25)/0.0065);
}

float getPitch(AxesRaw_TypeDef acc){
	return atan2(-acc.AXIS_X, sqrt(pow(acc.AXIS_Y, 2)+  pow(acc.AXIS_Z, 2)));
}

float getRoll(AxesRaw_TypeDef acc){
	return atan2(acc.AXIS_Y, sqrt(pow(acc.AXIS_X, 2) + pow(acc.AXIS_Z, 2)));
}

float getYaw(AxesRaw_TypeDef mag, float pitch, float roll){
	float num = mag.AXIS_Z * sin(roll) - mag.AXIS_Y * cos(roll);
	float tem = mag.AXIS_Y * sin(roll) + mag.AXIS_Z * cos(roll);
	float den = mag.AXIS_X * cos(pitch) + tem * sin(pitch);
	return atan2(num, den);
}

/** System Clock Configuration
 */
void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE();

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 16;
	RCC_OscInitStruct.PLL.PLLN = 336;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
	RCC_OscInitStruct.PLL.PLLQ = 7;

	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);


}



/* **************************************************************** */
/* **************************************************************** */
/* **************** FROM LAB2 TO LAB7 - NO LAB1 ! ***************** */
/* **************************************************************** */
/* **************************************************************** */



/* ADC1 init function */
void MX_ADC1_Init(void)
{

